import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-insurance-info',
  templateUrl: './insurance-info.component.html',
  styleUrls: ['./insurance-info.component.css']
})
export class InsuranceInfoComponent implements OnInit {
  insurancesList = [
    {
      name: 'Гражданска Отговорност', logo: 'https://izbiram.bg/tmp/mtpl_0.png',
      about: `Застраховка „Гражданска отговорност” покрива отговорността на собствениците и водачите на МПС за причинени от тях
  телесни увреждания и/или смърт и/или материални щети на трети лица, за които те носят отговорност съгласно действащото законодателство.

      ЛИМИТИ НА ОТГОВОРНОСТ:

  Лимитите на отговорност са еднакви за всички застрахователни компании и са както следва:

  При събития, настъпили на територията на Република България:
  За всяко събитие при едно пострадало лице – 2 000 000 лева;
  За всяко събитие при две или повече пострадали лица – 10 000 000 лева;
  За вреди на имущество за всяко събитие – 2 000 000 лева.

  При събития, настъпили на територията на държава членка на Европейския съюз:

  Минималните лимити на отговорност, приложими в съответната държава членка,
  на територията на която е настъпило застрахователното събитие, съгласно нейния закон или покритието съгласно закона на територията,
  където обичайно се намира моторното превозно средство, когато това покритие е по-високо.

      СРОК И НАЧИН НА ПЛАЩАНЕ:

  Застраховка Гражданска отговорност се сключва за срок от една година. Всички застрахователни компании предлагат разсрочено плащане,
  което в повечето случаи е със завишение на застрахователната премия.

  ТЕРИТОРИЯ НА ВАЛИДНОСТ:

  Застраховка Гражданска отговорност на автомобилистите е валидна на територията на страните, членки на Европейски съюз,
  Европейското икономическо пространство и тези, подписали Многостранното споразумение (Австрия, Белгия, България,
  Великобритания, Германия, Гърция, Дания, Естония, Ирландия, Исландия, Испания, Италия, Кипър, Латвия, Литва, Люксембург,
  Малта, Норвегия, Полша,Португалия, Румъния, Словакия, Словения, Унгария, Финландия Франция Холандия, Хърватска, Чехия,
  Швеция, плюс Андора, Сърбия и Швейцария).

  За да има покритие застраховката и в останалите държави членки на споразумението Зелена карта - Албания, Босна и Херцеговина,
  Беларус, Македония, Израел, Иран, Молдова, Мароко, Русия, Тунис, Турция, Украйна и Черна гора е възможно доплащане,
  което разширява покритието на застраховката и я прави валидна на територията на тези държави.

  При пътуване в държави извън ЕС, ЕИП и страните от МС се издава сертификат Зелена карта,
  който е безплатен или е на цена от 1,00 до 51,00 лева, в зависимост от застрахователната компания.

      КАКВО ВСЪЩНОСТ Е СЕРТИФИКАТ ЗЕЛЕНА КАРТА?

  Зелената карта е международен сертификат към Гражданската отговорност, който удостоверява дали МПС
  има валидна Гражданска отговорност и дали полицата покрива територията на съответната държава.

      КОГА Е НЕОБХОДИМ СЕРТИФИКАТ ЗЕЛЕНА КАРТА?

  За страните, членки на Европейски съюз, Европейското икономическо пространство и тези, подписали
  Многостранното споразумение, сертификатът НЕ е необходим. Няма граничен контрол и не се изисква при влизане
  на територията на съответната държава. Държавите в които е валидна застраховката са: Австрия, Белгия,
  България, Великобритания, Германия, Гърция, Дания, Естония, Ирландия, Исландия, Испания, Италия, Кипър, Латвия,
  Литва, Люксембург, Малта, Норвегия, Полша,Португалия, Румъния, Словакия, Словения, Унгария, Финландия, Франция,
  Холандия, Чехия, Швеция плюс Андора, Хърватска и Швейцария.


  Сертификат зелена карта Е задължителен при пътуване във всички други страни, членки на споразумението Зелена карта -
  Албания, Босна и Херцеговина, Беларус, Македония, Израел, Иран, Молдова, Мароко, Русия, Тунис, Турция, Украйна и Черна гора.
  Документът ще бъде изискан при преминаване на границата, при пътна проверка или при ПТП.` },
    {
      name: 'Каско', logo: 'https://izbiram.bg/tmp/kasko%20copy.png',
      about: `Застраховка Автокаско осигурява пълна застрахователна защита на МПС срещу пожар, кражба, злоумишлени действия на трети лица,
    природни бедствия, пътно-транспортни произшествия включително щети в паркирано състояние и други неизключени събития, водещи до
    частична повреда или пълна загуба на автомобила.

    Покритите рискове могат да бъдат:
    •    Пожар
    •    Експлозия
    •    Природни бедствия
    •    Авария
    •    Пътно-транспортно произшествие
    •    Злоумишлени действия на трети лица
    •    Кражба или грабеж

    Застраховката може да включва само някои от изброените покрития, които са съобразени с предназначението на автомобила и желания размер
    на застрахователната премия (цената на застраховката) от страна на клиента.
    Застраховката е доброволна, т.е. няма задължителен характер както застраховка Гражданска отговорност. Полицата обикновено се сключва за
    период от една година, освен ако не е уговорено друго.

    •    НЕОБХОДИМИ ДОКУМЕНТИ И ИЗИСКВАНИЯ ЗА АВТОМОБИЛА

    За сключването на застраховка Автокаско е необходимо да представите копие от свидетелството за регистрация на МПС (талона).
    Ако автомобилът е новозакупен от официалния вносител на дадената марка, е необходимо копие от фактурата за закупуване и копие от талона.
    При сключване на застраховката и през срока на действие е необходимо автомобилът да бъде технически изправен, което се доказва с талон
    за технически преглед. При настъпване на застрахователно събитие, застрахователите проверяват валидността на талона за
    технически преглед, така че го следете и Вие.
    Повечето застрахователни компании изискват при сключването на застраховка Каско автомобилът да бъде снабден с действаща звукова алармена
    система, а след издаване на полицата „Автокаско на МПС“ да бъде направен оглед на МПС. Само така ще имате покритие за всички рискове за
    МПС-то Ви.

    •    ТЕРИТОРИЯ НА ВАЛИДНОСТ НА АВТОКАСКО

    Застраховката е валидна на територията на Р. България. В случай че застраховките Каско и Гражданска отговорност са сключени в една и
    съща застрахователна компания, то МПС получава безплатно покритие по Автокаско в държавите членки на Европейския съюз . Ако двете
    застраховки са в различни компании, за да е валидна застраховката Автокаско в чужбина, се издава добавък към полицата,
    който се заплаща по определената от съответния застраховател тарифа.
    Застраховката в определени компании може да е валидна за Р.България и чужбина, (ЕС и държавите членки на МСЗК) без значение къде е
    сключена Гражданската отговорност. В определени държави рискът Кражба е изключен (Русия, Украйна, Беларус, Молдова, Албания,
      Босна и Херцеговина и Косово).
    Обичайно застраховката Автокаско важи за територията на Република България. През последните години застрахователите предлагат
    безплатно покритие за чужбина, но във всички случаи препоръчваме да се консултирате с брокера Ви или да огледате внимателно полицата
    преди да напуснете страната.

    •    ЗАСТРАХОВАТЕЛНА СУМА

    Договорената застрахователна сума не може да надвишава действителната стойност на МПС към датата на сключване на застраховката и
    се определя на база предоставените данни за марката и модела на автомобила, година на производство, кубатура, вид гориво,
    киловати/конски сили, брой врати и други негови технически характеристики.

    •    КАКВА Е ЦЕНАТА НА ЗАСТРАХОВКАТА АВТОКАСКО?

    Цената на застраховка Автокаско е индивидуална и се определя от вида на автомобила, особеностите му и допълнителното му оборудване
    и особено от Вашите лични предпочитания за възстановяване на автомобила при събитие. Застраховката може да се плати в брой или по
    банков път, да се плати еднократно или на разсрочено плащане (до 4 вноски), като при повечето застрахователи не се прилага завишение.
    От цената ползвате отстъпки – за подновяване без щети, за еднократно плащане, за нов клиент, за наличие на Гражданска отговорност
    към същата компания. Нашите индивидуални отстъпки с Клубна карта ще направят предложението най-изгодно за Вас.

    •    ПРИ СЪБИТИЕ

    При настъпване на застрахователно събитие, с оглед на получаване на адекватно обезщетение, застрахованият трябва стриктно да спазва
    изискванията, които са описани в Общите условия на застраховката Автокаско, а именно:
    -да уведоми незабавно компетентните държавни органи (Полиция, служба Пожарна и Аварийна безопасност, други);
    -да уведоми писмено застрахователя, като спазва сроковете, описани в Общите условия на застраховката;
    -да предостави увреденото МПС за оглед пред застрахователя без да е отстранена повредата.

    •    ПРЕФЕРЕНЦИИ

    Някои застрахователни компании предлагат като допълнение следните безплатни покрития по застраховка Автокаско:
    •    Безплатна, денонощна пътна помощ и сервиз, не само при пътно-транспортно произшествие, но и при повреда.
    •    Валидност на покритието за чужбина  без допълнително заплащане.
    •    Възможност за разширяване на териториалното покритие за чужбина и по отношение на рисковете пожар и кражба,
    без допълнително заплащане.
    •    Безплатен автоасистанс за чужбина;
    •    Посещение на мобилна група при ПТП;
    •    Заместващ автомобил;

    •    ВАЖНИ СЪВЕТИ

    При щета не отстранявайте повредите преди огледа!
    Ако изгубите или откраднат заключващо устройство, дистанционно управление, свидетелство за регистрация (талон) или
    регистрационни табели, незабавно уведомете КАТ и вземете служебна бележка. Уведомете застрахователя в срок до 24 часа.
    Не оставяйте/забравяйте ключовете, документите, полици и панела на радиооборудването в МПС.
    Не оставяйте МПС незаключено, със свалени прозорци или люкове, отворени капаци или врати, със свален покрив (ако е кабриолет),
    с невключена сигнална система, с ключ на запалването, когато го напускате, независимо че може да е за кратко!
    Всички лица, управляващи застрахованото МПС, следва да притежават валидно свидетелство за правоуправление за съответната
    категория автомобили и да спазват Закона за движение по пътищата.
    Управлявайте автомобила само по Републиканската пътна мрежа, като не навлизате в наводнени пътища или територии, затворени,
    забранени за движение и сигнализирани за тази цел пътни участъци.
    Пазете и ползвайте застрахованото МПС с грижата на добър стопанин. Поддържайте го в добро техническо състояние, както и предприемайте
    всички обичайни и разумни предохранителни действия и мерки за предпазване на автомобила Ви от вреди.
    При всяка промяна уведомявайте Застрахователя (смяна на адрес, покупко-продажба, дарение, замяна, изменение в ползването на МПС и др.).

    •    СРОКОВЕ ЗА ЗАВЕЖДАНЕ НА ЩЕТИ

    За събития, различни от пожар и кражба – уведомете писмено в 3-дневен срок застрахователя;
    При пожар и кражба – уведомете писмено, в срок до 24 часа от узнаване на събитието застрахователя.
    Ако изгубите или откраднат заключващо устройство, дистанционно управление или свидетелство за регистрация (талон) или регистрационни
    табели, незабавно уведомете КАТ и вземете служебна бележка. Уведомете застрахователя в срок до 24 часа.
    Във всички случаи  уведомете незабавно и компетентните органи за издаване на съответния документ:

         при ПТП -  КАТ на тел.166 или тел.112 и поискайте посещение на място;
         при кражба - РУ на МВР, на чиято територия се намирате;
         при природни бедствия – Метеорологична служба на тел.090012015;
         при пожар – Противопожарна служба на тел. 160 или тел.112;


    •    НЕОБХОДИМИ ДОКУМЕНТИ ЗА ЗАВЕЖДАНЕ НА ЩЕТИ

        Застрахованият или негов упълномощен представител представя следните оригинални документи:

         Застрахователна полица, включително всички издадени добавъци и приложения към нея;
         Свидетелство за регистрация на МПС;
         Свидетелство за правоуправление на водача, управлявал МПС при настъпването на застрахователно събитие;
         Попълнено заявление за изплащане на застрахователно обезщетение;
         Оригинален документ, доказващ настъпилото събитие (двустранен констативен протокол, служебна бележка и др);
        Удостоверение за техническа изправност (талон за преминат годишен технологичен преглед).
    ` },
    {
      name: 'Имущество', logo: 'https://izbiram.bg/tmp/property-insurance.png',
      about: `Застраховката се сключва само с физически лица. Застраховат се къщи или апартаменти, които са основни
    жилища и постоянно обитаеми, както и движимите имущества в тях. Застрахователните покрития са групирани в девет варианта,
    в зависимост от квадратурата, застрахователната сума на жилището и застрахователната сума на движимото имущество.

    Покритите рискове могат да бъдат:

    Пожар и природни бедствия;
    Земетресение;
    Аварии;
    Кражба чрез взлом;
    Тероризъм;
    Отговорност към трети лица;
    ` }];

  constructor() { }

  content = this.getAll();

  parentLoadContent(value) {
    if (value === 'Застраховки') {
      this.content = this.getAll();
    } else {
      this.content = [this.insurancesList.find(x => x.name === value)];
    }
  }

  getAll() {
    const all = [];
    this.insurancesList.forEach(x => {
      all.push({ name: x.name, logo: x.logo });
    });
    return all;
  }

  ngOnInit() {
  }
}
